app/views/events/_form.html.erb

    <select name="place_id"  >
      <option value= <%= params[:place_id].to_i %> > <%=Place.find_by_id(params[:place_id]).name %>  </option>
---
SELECT "places".* FROM "places" WHERE "places"."id" IS NULL LIMIT 1