app/controllers/events_controller.rb

SELECT "places".* FROM "places" WHERE "places"."id" IS NULL LIMIT 1
---
  def create
	@event = Event.new(params[:event])

    	if @event.save
          redirect_to user_place_event_path(@event, :place_id => @event.place_id, :user_id => Place.find_by_id(@event.place_id).user_id)