app/controllers/places_controller.rb

SELECT "places".* FROM "places"
---
  def index
	if current_user == nil
		redirect_to root_path
	else
		@places=Place.all